# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PreviewControl..::..Dispose Method
PreviewControl Class See Also
---
This method is called if the user explicitly disposes of the object (by calling the Dispose method in other managed languages, or the destructor in C++).
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
PreviewControl Class
Autodesk.Revit.UI Namespace